app/views/static_pages/home.html.erb

  <tbody>
    <% @books.where(:isactivebook => true).each do |book| %>
---
SELECT "books".* FROM "books" WHERE "books"."isactivebook" = ?  [["isactivebook", 1]]