app/controllers/admin/books_controller.rb

INSERT INTO "books" ("title", "isbn", "description", "author", "image", "member_id", "isactivebook", "end_date", "max_end_date", "last_loan_date", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @book = Book.new(book_params)

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in. #notlogin"
    else
      #si on essaye d'accéder à une page alors qu'on est pas admin
       if current_member.isadmin == false || current_member.isadmin.nil?
        redirect_to current_member, notice: "You can only access to your account details #notadmin"
      end
    end

    respond_to do |format|
      if @book.save

UPDATE "books" SET "isactivebook" = ?, "end_date" = ?, "max_end_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["isactivebook", "f"], ["end_date", "2016-06-07 18:02:00.000000"], ["max_end_date", "2016-08-06 18:02:00.000000"], ["updated_at", "2016-05-08 18:38:20.835434"], ["id", 2]]
---
  def update

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in. #notlogin"
    else
      #si on essaye d'accéder à une page alors qu'on est pas admin
       if current_member.isadmin == false || current_member.isadmin.nil?
        redirect_to current_member, notice: "You can only access to your account details #notadmin"
      end
    end


    respond_to do |format|
      if @book.update(book_params)

DELETE FROM "books" WHERE "books"."id" = ?  [["id", 1]]
---
  def destroy

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in. #notlogin"
    else
      #si on essaye d'accéder à une page alors qu'on est pas admin
       if current_member.isadmin == false || current_member.isadmin.nil?
        redirect_to current_member, notice: "You can only access to your account details #notadmin"
      end
    end

    if !@book.isactivebook
      @book.destroy