app/controllers/admin/members_controller.rb

SELECT "members".* FROM "members"
---
  def index
    @members = Member.all

INSERT INTO "members" ("login", "password_digest", "firstname", "lastname", "address1", "address2", "phoneno", "isactivemember", "isadmin", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?, ?)
---
  def create
    @member = Member.new(member_params)

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in. #notlogin"
    else
      #si on essaye d'accéder à une page alors qu'on est pas admin
       if current_member.isadmin == false || current_member.isadmin.nil?
        redirect_to current_member, notice: "You can only access to your account details #notadmin"
      end
    end


    respond_to do |format|
      if @member.save

UPDATE "members" SET "password_digest" = ?, "isadmin" = ?, "updated_at" = ? WHERE "members"."id" = ?  [["password_digest", "$2a$10$1w8MOPjNVHeEYcRvAq5dUe/72.ubstHl1XdpMVs0yoQQ5nxb1BMEe"], ["isadmin", "t"], ["updated_at", "2016-05-08 20:02:45.129418"], ["id", 1]]
---
  def update

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in. #notlogin"
    else
      #si on essaye d'accéder à une page alors qu'on est pas admin
       if current_member.isadmin == false || current_member.isadmin.nil?
        redirect_to current_member, notice: "You can only access to your account details #notadmin"
      end
    end

    respond_to do |format|
      if @member.update(member_params)

SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 3]]
---
    def set_member
      @member = Member.find(params[:id])