app/views/admin/loan.html.erb

SELECT "books".* FROM "books" WHERE (isactivebook = true) AND (member_id != 0))
SELECT "members".* FROM "members" WHERE (isactivemember = 't')
---
  <%= label_tag(:book, "Select a book:") %>
  <%= collection_select(:book, :id, Book.all.where("isactivebook = ? AND member_id = ?", true, 0), :id, :title, {prompt: 'Select Book'}) %>
  <%= label_tag(:member, "Select a member:") %>
  <%= collection_select(:member, :id, Member.all.where("isactivemember = ?", true), :id, "full_name", {disabled: lambda{|member| member.isactivemember == 0 }}) %>