app/controllers/admins_controller.rb

SELECT "admins".* FROM "admins"
---
  def index
    @admins = Admin.all

INSERT INTO "admins" ("login", "password", "created_at", "updated_at") VALUES (?, ?, ?, ?)  [["login", "MyString"], ["password", "MyString"], ["created_at", "2016-05-07 20:37:57.002857"], ["updated_at", "2016-05-07 20:37:57.002857"]]
---
  def create
    @admin = Admin.new(admin_params)

    respond_to do |format|
      if @admin.save

DELETE FROM "admins" WHERE "admins"."id" = ?  [["id", 980190962]]
---
  def destroy
    @admin.destroy

SELECT  "admins".* FROM "admins" WHERE "admins"."id" = ? LIMIT 1  [["id", 980190962]]
---
    def set_admin
      @admin = Admin.find(params[:id])