app/controllers/admin_controller.rb

  def loan
    @books = Book.all
---
SELECT "books".* FROM "books" WHERE (isactivebook = true) AND (member_id != 0))

  def assign
    @b = Book.find(params[:book][:id])
    @m = Member.find(params[:member][:id])

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in. #notlogin"
    else
      #si on essaye d'accéder à une page alors qu'on est pas admin
       if current_member.isadmin == false || current_member.isadmin.nil?
        redirect_to current_member, notice: "You can only access to your account details #notadmin"
      end
    end

    if @b.member_id == @m.id #Renew Loan
      if @b.max_end_date && (@b.max_end_date > DateTime.now)
        if @b.max_end_date > @b.end_date + 30.days
          @b.end_date = @b.end_date + 30.days
        else
          @b.end_date = @b.max_end_date
        end
      end
    else #New Loan
      @b.member_id = @m.id
      @b.end_date = DateTime.now + 30.days
      @b.max_end_date = DateTime.now + 90.days
    end
    @b.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 5]]
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "member_id" = ?, "end_date" = ?, "max_end_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["member_id", 1], ["end_date", "2016-06-07 17:36:36.828094"], ["max_end_date", "2016-08-06 17:36:36.829188"], ["updated_at", "2016-05-08 17:36:36.831549"], ["id", 1]]

  def returned
    @b = Book.find(params[:book][:id])

    @b.last_member_id = @b.member_id
    @b.member_id = 0
    @b.end_date = nil
    @b.max_end_date = nil
    @b.last_loan_date = DateTime.now
    @b.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "last_member_id" = ?, "member_id" = ?, "end_date" = ?, "max_end_date" = ?, "last_loan_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["last_member_id", 1], ["member_id", 0], ["end_date", nil], ["max_end_date", nil], ["last_loan_date", "2016-05-08 19:34:19.782808"], ["updated_at", "2016-05-08 19:34:19.784138"], ["id", 1]]