app/controllers/member_controller.rb

  def index
    @books = Book.all
---
SELECT "books".* FROM "books" WHERE "books"."member_id" = ?  [["member_id", 0]]

  def show
    @books = Book.all

    #Restrict accesss
    if current_member.nil?
      redirect_to login_path, notice: "You cannot access here before log in."
    else
      #si on essaye d'accéder à une page qui nexiste pas
      if Member.exists?(params[:id])
        @member = Member.find(params[:id])
---
SELECT "books".* FROM "books" WHERE "books"."member_id" = ?  [["member_id", 3]]
SELECT  "members".* FROM "members"  ORDER BY "members"."id" ASC LIMIT 1
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 1]]

  def renew
    @b = Book.find(params[:id])

    if @b.member_id == current_member.id #Renew Book
      if @b.max_end_date && (@b.max_end_date > DateTime.now)
        if @b.max_end_date > @b.end_date + 30.days
          @b.end_date = @b.end_date + 30.days
        else
          if @b.end_date == @b.max_end_date
            flash[:danger] = "You can't renew, you have reached your limit (90 days) for this book"
            redirect_to current_member
            return
          else
            @b.end_date = @b.max_end_date
          end
        end
      end
    end
    @b.save
---
SELECT  "books".* FROM "books" WHERE "books"."id" = ? LIMIT 1  [["id", 1]]
UPDATE "books" SET "end_date" = ?, "updated_at" = ? WHERE "books"."id" = ?  [["end_date", "2016-07-07 20:30:27.123997"], ["updated_at", "2016-05-08 21:03:17.879514"], ["id", 1]]