app/controllers/members_controller.rb

  def index
    @members = Member.all
---
SELECT "members".* FROM "members"

  def create
    @member = Member.new(member_params)

    respond_to do |format|
      if @member.save
---
INSERT INTO "members" ("login", "password", "firstname", "lastname", "address1", "address2", "phoneno", "isactivemember", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?, ?, ?, ?, ?)

  def destroy
    @member.destroy
---
DELETE FROM "members" WHERE "members"."id" = ?  [["id", 980190962]]

    def set_member
      @member = Member.find(params[:id])
---
SELECT  "members".* FROM "members" WHERE "members"."id" = ? LIMIT 1  [["id", 980190962]]