app/controllers/sessions_controller.rb

SELECT  "members".* FROM "members" WHERE "members"."login" = ? LIMIT 1  [["login", "ffff"]]
---
  def create
    member = Member.find_by(login: params[:session][:login].downcase)